docs: more docs updates (#123)
